Examinator/src/InformationRegisters/ФайлыПроверенныеПреподавателямиСУО/ФайлыПроверенныеПреподавателямиСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФайлыПроверенныеПреподавателямиСУО</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions>
    <name>Файл</name>
    <type>
      <types>CatalogRef.ПопыткаВыполненияЗаданияСУОПрисоединенныеФайлы</types>
      <types>CatalogRef.ПрохождениеОбученияСУОПрисоединенныеФайлы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеВебКабинетаСУО_ПП/ДанныеВебКабинетаСУО_ПП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУО_ПП</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыДанныхВебКабинетаСУО/ТипыДанныхВебКабинетаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДанныхВебКабинетаСУО</name>
  <enumValues>
    <name>УчебнаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>РезультатыТестирования</name>
  </enumValues>
  <enumValues>
    <name>УчастникОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеЗаявки</name>
  </enumValues>
  <enumValues>
    <name>РазделФорума</name>
  </enumValues>
  <enumValues>
    <name>РазделФорумаОписание</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщения</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщенияОписание</name>
  </enumValues>
  <enumValues>
    <name>Сообщение</name>
  </enumValues>
  <enumValues>
    <name>СообщениеОписание</name>
  </enumValues>
  <enumValues>
    <name>Организатор</name>
  </enumValues>
  <enumValues>
    <name>БиблиотекаПользователя</name>
  </enumValues>
  <enumValues>
    <name>Новость</name>
  </enumValues>
  <enumValues>
    <name>НовостьОписание</name>
  </enumValues>
  <enumValues>
    <name>КнигаОписание</name>
  </enumValues>
  <enumValues>
    <name>КаталогПользователей</name>
  </enumValues>
  <enumValues>
    <name>ПользовательОписание</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппа</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппаОписание</name>
  </enumValues>
  <enumValues>
    <name>ФайлУчащегося</name>
  </enumValues>
  <enumValues>
    <name>ПреподавателиПользователя</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>ОценкиКачестваОбучения</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ФорматыВебДанныхСУ/ФорматыВебДанныхСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФорматыВебДанныхСУ</name>
  <enumValues>
    <name>xml</name>
  </enumValues>
  <enumValues>
    <name>json</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/InformationRegisters/ФайлыПроверенныеПреподавателямиСУО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗапомнитьПроверенныеФайлы(Знач МассивФайлов, Знач Преподаватель=Неопределено, Знач ДатаПроверки=Неопределено, НеОбновлятьДанныеВебКабинета=Неопределено) Экспорт
	
	Если ДатаПроверки = Неопределено Тогда
		ДатаПроверки = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Преподаватель = Неопределено Тогда
		Преподаватель = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Для каждого Файл Из МассивФайлов Цикл
	
		НаборЗаписей = РегистрыСведений.ФайлыПроверенныеПреподавателямиСУО.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Период.Установить(ДатаПроверки);
		НаборЗаписей.Отбор.Файл.Установить(Файл);
		НаборЗаписей.Отбор.Преподаватель.Установить(Преподаватель);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Файл = Файл;
		НоваяЗапись.Преподаватель = Преподаватель;
		НоваяЗапись.Период = ДатаПроверки;
		
		Если НеОбновлятьДанныеВебКабинета <> Неопределено Тогда
			НаборЗаписей.ДополнительныеСвойства.Вставить("НеОбновлятьДанныеВебКабинета", НеОбновлятьДанныеВебКабинета);
		КонецЕсли;		
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьПроверенныеФайлы(Знач МассивФайлов, Знач Преподаватель=Неопределено, НеОбновлятьДанныеВебКабинета=Неопределено) Экспорт
	
	Если Преподаватель = Неопределено Тогда
		Преподаватель = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Для каждого Файл Из МассивФайлов Цикл
	
		НаборЗаписей = РегистрыСведений.ФайлыПроверенныеПреподавателямиСУО.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Файл.Установить(Файл);
		НаборЗаписей.Отбор.Преподаватель.Установить(Преподаватель);
		
		Если НеОбновлятьДанныеВебКабинета <> Неопределено Тогда
			НаборЗаписей.ДополнительныеСвойства.Вставить("НеОбновлятьДанныеВебКабинета", НеОбновлятьДанныеВебКабинета);
		КонецЕсли;		
		
		НаборЗаписей.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры

// Веб-кабинет

Процедура ОбновитьДанныеВебКабинета(ФайлИлиОтбор, ДополнительныеДанные=Неопределено) Экспорт

	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ФайлИлиОтбор) = Тип("СправочникСсылка.ПрохождениеОбученияСУОПрисоединенныеФайлы") Тогда
		
		Файл = ФайлИлиОтбор;
		
	Иначе
		
		Если ФайлИлиОтбор.Найти("Файл") = Неопределено Тогда
			Возврат;
		Иначе
			Файл = ФайлИлиОтбор.Файл.Значение;
		КонецЕсли;
		
	КонецЕсли;	
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ПП.УдалитьДанные(Файл, Перечисления.ТипыДанныхВебКабинетаСУО.ФайлУчащегося); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФайлыПроверенныеПреподавателямиСУО.Период КАК ДатаПроверки,
		|	ФайлыПроверенныеПреподавателямиСУО.Преподаватель КАК Преподаватель
		|ИЗ
		|	РегистрСведений.ФайлыПроверенныеПреподавателямиСУО КАК ФайлыПроверенныеПреподавателямиСУО
		|ГДЕ
		|	ФайлыПроверенныеПреподавателямиСУО.Файл = &Файл";

	Запрос.УстановитьПараметр("Файл", Файл);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОписаниеПроверки = ФайлУчащегосяПроверенJSON(Файл, ВыборкаДетальныеЗаписи.ДатаПроверки);
		
		РегистрыСведений.ДанныеВебКабинетаСУО_ПП.ДобавитьДанные(ВыборкаДетальныеЗаписи.ДатаПроверки, ВыборкаДетальныеЗаписи.Преподаватель, Перечисления.ТипыДанныхВебКабинетаСУО.ФайлУчащегося, Файл, ОписаниеПроверки, Перечисления.ФорматыВебДанныхСУ.json);
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ФайлУчащегосяПроверенJSON(Файл, ДатаПроверки)
	
	ОписаниеФайла = Новый Структура("Идентификатор, Проверено, ДатаПроверкиЧисло");
	ОписаниеФайла.Идентификатор = Файл.УникальныйИдентификатор();
	ОписаниеФайла.Проверено = Истина;
	ОписаниеФайла.ДатаПроверкиЧисло = ОбщегоНазначенияСУКлиентСервер.ДатаВЧислоJS(ДатаПроверки);
	
	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(ОписаниеФайла); 
	
КонецФункции

#КонецЕсли
